app/Controllers/Dashboard.php

SELECT *
FROM `sekolah`
---
 public function index(){
 // inisiasi objek dari class KabupatenModel
 $kabupaten = new KabupatenModel();
 // ambil data dari tabel kabupaten
 // angka 1 mengacu pada data id_kabupaten di tabel kabupaten
 // artinya mencari data id_kabupaten = 1
 $data['kabupaten'] = $kabupaten->find(1);
 // menampilkan file views/dashboard.php di browser
 // mengirimkan data kabupaten melalui variabel $data
 // inisiasi object dari class SekolahModel
 $sekolah = new SekolahModel();
 // mengambil semua data sekolah
 $query = $sekolah->findAll();