app/Controllers/Kecamatan.php

public function tampil(){
$kecamatan = new KecamatanModel();
// mengambil semua data di tabel kecamatan
$data['query'] = $kecamatan->findAll();
---
SELECT *
FROM `kecamatan`